Show / Hide Table of Contents
Class FatigueLoading
Fatigue loading
Inheritance
System.Object
FatigueLoading
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Concrete.Load
Assembly: IdeaRS.OpenModel.dll
Syntax
public class FatigueLoading
Constructors
Improve this Doc   View Source
FatigueLoading()
Constructor
Declaration
public FatigueLoading()
Properties
Improve this Doc   View Source
MaxLoading
Max. cyclic loading
Declaration
public LoadingULS MaxLoading { get; set; }
Property Value
 Type |  Description
 LoadingULS
Improve this Doc   View Source
MinLoading
Min. cyclic loading
Declaration
public LoadingULS MinLoading { get; set; }
Property Value
 Type |  Description
 LoadingULS
 Improve this Doc
 View Source